Public Attributes | List of all members
API_QuantityPar Struct Reference
Element Manager
Supplies extra information for some element quantity calculations. More...
#include <APIdefs_Elements.h>
 Public Attributes
 double  | minOpeningSize
minimum opening size to reduce wall [in square meters] (ignored at non-wall calculations)
Detailed Description
Supplies extra information for some element quantity calculations.
Remarks
At wall calculations: Openings which are smaller than the supplied minimum area minOpeningSize are not subtracted from the surface of the wall.